public/all-posts.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-04-26 Sat 15:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Joshua Rasband" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="css/stylesheet.css" type="text/css"/>
</head>
<body>
<div id="content" class="content">
<div id="outline-container-orgacf43a1" class="outline-2">
<h2 id="orgacf43a1">Home</h2>
<div class="outline-text-2" id="text-orgacf43a1">
</div>
</div>
<div id="outline-container-org7a4b03e" class="outline-2">
<h2 id="org7a4b03e">Research</h2>
<div class="outline-text-2" id="text-org7a4b03e">
<p>
My current project is exploring a model of distraction in a cerebellum-dependent
learned behavior.
</p>
</div>
</div>
<div id="outline-container-org2c1a884" class="outline-2">
<h2 id="org2c1a884">Blog</h2>
<div class="outline-text-2" id="text-org2c1a884">
</div>
</div>
<div id="outline-container-orgefe9e9a" class="outline-2">
<h2 id="orgefe9e9a">About</h2>
<div class="outline-text-2" id="text-orgefe9e9a">
<ul class="org-ul">
<li>MD/PhD student in the United States</li>
<li>Currently working on a neuroscience PhD</li>
<li><a href="https://github.com/jrasband/">github</a></li>
<li><a href="https://orcid.org/0000-0002-9548-7311">ORCID</a></li>
<li><a href="https://x.com/JoshuaRasband">X (Twitter)</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgeef4e15" class="outline-2">
<h2 id="orgeef4e15">Time to write&#xa0;&#xa0;&#xa0;<span class="tag"><span class="writing">writing</span></span></h2>
<div class="outline-text-2" id="text-orgeef4e15">
<blockquote>
<p>
If writing down your ideas always makes them more precise and more complete,
then no one who hasn&rsquo;t written about a topic has fully formed ideas about it.
And someone who never writes has no fully formed ideas about anything
nontrivial.
</p>

<p>
&#x2014;Paul Graham
</p>
</blockquote>

<p>
I think that the next phase of my self-education is writing. Here&rsquo;s why:
</p>

<p>
<b>Writing generates an error signal:</b> Writing externalizes your thought process,
which makes it easier to reflect on which of your thoughts need to improve.
</p>

<p>
<b>Writing is a form of retrieval practice:</b> Retrieval practice is the best
known technique for building and strengthening long-term memory.
</p>

<p>
These two factors make writing a highly efficient learning technique.
</p>

<p>
Because I&rsquo;ve previously had a hard time writing consistently, I&rsquo;m making a
commitment: for the next month (until October 27th, 2024), I will write one blog
post every day. They probably won&rsquo;t be very long (or very good), but I&rsquo;m going to
write them.
</p>
</div>
</div>
<div id="outline-container-org807d591" class="outline-2">
<h2 id="org807d591">Testing and worth&#xa0;&#xa0;&#xa0;<span class="tag"><span class="learning">learning</span></span></h2>
</div>
<div id="outline-container-org0715a77" class="outline-2">
<h2 id="org0715a77">Against additive solutions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="organization">organization</span></span></h2>
<div class="outline-text-2" id="text-org0715a77">
<p>
I was recently in a meeting where, multiple times, the default response to a
problem was &ldquo;we should form a committee to respond to the issue&rdquo; or &ldquo;someone
should be appointed to take care of this issue.&rdquo;
</p>

<p>
I think this is a natural way to view problems and solutions. It&rsquo;s a
human-centric view. In this view, problems get solved by people. When some
problem isn&rsquo;t getting solved because it&rsquo;s not in anyone&rsquo;s job description to
solve the problem, the logical response is to either delegate authority and
responsibility for solving the problem to a person or a committee.
</p>

<p>
It&rsquo;s a natural way to view problem-solving in organizations, but it&rsquo;s totally
wrong.
</p>

<p>
The first reason it&rsquo;s wrong is because it&rsquo;s what I call an &ldquo;additive&rdquo; solution.
The proposed solutions (forming a committee or appointing someone to address the
problem) will either add to the headcount of your organization or they will add
to the demands on people already at your organization.
</p>

<p>
What&rsquo;s so bad about additive solutions? It has to do with being able to predict
the downstream effects of the implemented solution. There is a fundamental
difference between a solution that involves adding a new component to a system,
versus a solution that takes away or modifies components that were already
there. When you add a new component, it&rsquo;s very difficult to anticipate all the
interactions that it will have with other components. In contrast, when you
modify or remove existing components, it&rsquo;s much easier to anticipate the
consequences by examining the role the component already plays in the system.
</p>

<p>
Additive solutions are slow. Creating a new component for your system is almost
certainly going to take more time than tweaking (or removing) something that&rsquo;s
already there. When starting from scratch, the design space is huge. In
constrast, when you&rsquo;re starting from an existing part, its attributes are mostly
fixed and you can think about a few dimensions that might need modification. At
the most extreme, you can decide to remove the component, which can be done
incredibly quickly.
</p>

<p>
Additive solutions are difficult to unwind. One a committee has been formed or a
person given a new responsibility, it is very difficult to turn back the clock,
even after the problem has been solved.
</p>

<p>
What&rsquo;s the alternative to additive solutions? Solutions that either modify or
remove existing components of the system. In my opinion, this is the most
effective way to solve problems because the problems are usually the result of
interactions of existing system components. Instead of adding downstream
components to solve problems that were introduced previously, why not go
upstream and prevent the problem from occurring in the first place?
</p>
</div>
</div>
<div id="outline-container-org8376978" class="outline-2">
<h2 id="org8376978">Book review: Poor Charlie&rsquo;s Almanac&#xa0;&#xa0;&#xa0;<span class="tag"><span class="bookreview">bookreview</span></span></h2>
<div class="outline-text-2" id="text-org8376978">
<p>
Poor Charlie&rsquo;s Almanac is a collection of talks and essays by Charles Munger,
who together with Warren Buffett established Berkshire Hathaway as one of the
greatest investment funds of all time. The talks cover topics from accounting
practices to the role of psychology in business to general life advice for
finding happiness.
</p>

<p>
<b>Why you should read this book:</b> It&rsquo;s fun to read and has good life advice. This
book exposes you to the mental models of a highly successful person. For me, the
biggest takeaway was the framework of &ldquo;mental models&rdquo; itself! I knew about
mental models, of course, but I had never thought specifically about the idea
that a collection of mental models of how the world works might serve as a
general-purpose system for problem-solving and understanding the world.
</p>

<p>
<b>Why you should not read this book:</b> If you&rsquo;re looking for specific, quantitative,
actionable investment advice, this is not the right book for you. I&rsquo;m sure that
Buffett and Munger have plenty of quantitative ways that they analyze their
investments, but this is not that kind of book. This is a book that gives a
window into the author&rsquo;s philosophy and worldview.
</p>
</div>
</div>
