content-org/all-posts.org
* Learning by boundary seeking :learning:parenting:
:PROPERTIES:
:EXPORT_FILE_NAME: 2024-10-01-learning-by-boundary-seeking
:EXPORT_DATE: 2024-10-01
:END:

In the last year since I became a parent, I've had the wonderful opportunity to
observe how my daughter acquires new skills and learns about the world around
her.

"Boundary seeking" is how I think of her main strategy for learning efficiently.

When she first encounters a new object, she pushes it to its limits. One day
last month she found a tote bag and played with it for the better part of an
hour. She dragged it around the room, she whipped it around her body as fast as
she could, she put her toys into it, she stepped on it, and of course, she put
it on her head, which she thought was hilarious. (Don't worry, the tote bag is made from a
breathable mesh and she was totally supervised the whole time.)

By sampling over a large distribution space, she was able to find the most
interesting things that she could do with the tote bag. She got lots of
information about the way that the tote bag behaves under a wide variety of
conditions. As she discovered new, interesting behaviors (like putting the bag
over her head) she spend more time exploring them.

This is a very efficient way to learn. Essentially, you sample as big a space as
you can, then focus on the areas of that space that are most interesting to you.
My theory is that these "interesting" areas of the space represent boundaries on
a manifold, where one behavior changes into another. (Think, for example, about
how the bag might be good for carrying things when you carry it loosely, but
when you swing it around your head it makes a /whooshing/ noise and it's more
fun.) The most efficient way to explore a high-dimensional space is to move
along boundaries, then use simple predictive heuristics to fill in the gaps
between boundaries.
* Reasons being a parent is awesome :parenting:
:PROPERTIES:
:EXPORT_FILE_NAME: 2024-10-02-reasons-being-a-parent-is-awesome
:EXPORT_DATE: 2024-10-02
:END:
I want to share some of the reasons being a parent has been (somewhat
unexpectedly) so good for me personally. I think these reasons will apply to
almost every parent.

Before I start, I want to make it clear my goal is /not/ to convince everyone to
have kids, but rather to show that parenthood is awesome in a couple of ways
that I don't think get talked about enough.

** Being /your/ child's parent has limited (or no) competition
Competition to be your child's best parent is extremely limited. Unlike your
professional interests (and likely your hobbies), the odds are pretty good that
the pool of people trying to parent /your child specifically/ is small. Sometimes,
it might be a pool of one. I certainly feel that I'm only competing against
myself---that my wife and I occupy different, non-competitive niches in our
daughter's life. Within my niche, I am number one; undefeated! It doesn't matter
to me that there isn't really anyone I'm competing against---it still gives me
satisfaction to know that I am the best at what I do.

Furthermore, whatever you do for your child is going to be a large fraction of
their life experience. It doesn't matter very much if the things you do for them
are imperfect---what matters more is that you try. Just trying can get you to
the top of the leaderboard---but you have to try.

** Being a parent is orthogonal to other interests
How good of a parent you are can be completely uncorrelated with your
professional success, your financial situation, or your hobbies. This
decorrelation between parenting and the rest of your life makes it easier to
still feel like a success, even if the only thing you're succeeding in is being
a good parent to your child.
** Being a parent is a great mix of instant and delayed gratification
There are two kinds of work---work that has instantaneous rewards, and work that
has delayed rewards. In my experience, optimal productivity and happiness in
one's work requires a mix of both kinds of work.

Working without any short-term feedback on how you're doing makes it difficult
to improve. Also, a lack of short-term rewards in your work will make each day
exhausting, because at the end of each day you can be left thinking "What did I
do all that work today for?"

On the other hand, work that only has short-term rewards will never build up to
a lifetime of achievement that you can look back on with satisfaction. You might
be happy on each individual day, but the overall narrative arc is missing.

Parenting, in my opinion, has the perfect mix of short-term and long-term
rewards. In the short-term, it is generally rewarding to spend any amount of
time with your kids doing something they enjoy. In the long-term, the things you
work to teach them (both knowledge and values) can gradually shape your child
into a fully-fledged human that you are happy to associate with.
* I fixed some chairs :life:
:PROPERTIES:
:EXPORT_FILE_NAME: 2024-10-03-i-fixed-some-chairs
:EXPORT_DATE: 2024-10-03
:END:
Today I fixed some chairs and it was the most satisfying thing I did all day.

My wife bought some used chairs yesterday, and she noticed after bringing them
home that they were a little wobbly. This evening, I pulled out my tools and
started tightening screws to see if I could fix the problem.

In the process, I discovered that one of the chairs had been put together
incorrectly, with two of the legs having been swapped. Because it
was put together wrong, it was very wobbly and some of the pieces were jammed
together at crooked angles.

Being able to sit down with a set of tools, diagnose a problem, and make the
world a better place in just half an hour is a wonderful thing to experience. It
wasn't a big fix, but it greatly improves the experience of sitting in those
chairs.

I think everybody needs moments like this. Everyone needs to experience
regularly the satisfaction of problem-solving on a short timescale. Most of the
things I do on a daily basis do not give me immediate rewards, and that makes it
important that I find things that do give me immediate satisfaction---running,
cooking, and playing with my daughter are examples that come to mind.
