public/all-posts.html
<div id="outline-container-orge992fb5" class="outline-2">
<h2 id="orge992fb5">Learning by boundary seeking&#xa0;&#xa0;&#xa0;<span class="tag"><span class="learning">learning</span>&#xa0;<span class="parenting">parenting</span></span></h2>
<div class="outline-text-2" id="text-orge992fb5">
<p>
In the last year since I became a parent, I&rsquo;ve had the wonderful opportunity to
observe how my daughter acquires new skills and learns about the world around
her.
</p>

<p>
&ldquo;Boundary seeking&rdquo; is how I think of her main strategy for learning efficiently.
</p>

<p>
When she first encounters a new object, she pushes it to its limits. One day
last month she found a tote bag and played with it for the better part of an
hour. She dragged it around the room, she whipped it around her body as fast as
she could, she put her toys into it, she stepped on it, and of course, she put
it on her head, which she thought was hilarious. (Don&rsquo;t worry, the tote bag is made from a
breathable mesh and she was totally supervised the whole time.)
</p>

<p>
By sampling over a large distribution space, she was able to find the most
interesting things that she could do with the tote bag. She got lots of
information about the way that the tote bag behaves under a wide variety of
conditions. As she discovered new, interesting behaviors (like putting the bag
over her head) she spend more time exploring them.
</p>

<p>
This is a very efficient way to learn. Essentially, you sample as big a space as
you can, then focus on the areas of that space that are most interesting to you.
My theory is that these &ldquo;interesting&rdquo; areas of the space represent boundaries on
a manifold, where one behavior changes into another. (Think, for example, about
how the bag might be good for carrying things when you carry it loosely, but
when you swing it around your head it makes a <i>whooshing</i> noise and it&rsquo;s more
fun.) The most efficient way to explore a high-dimensional space is to move
along boundaries, then use simple predictive heuristics to fill in the gaps
between boundaries.
</p>
</div>
</div>
<div id="outline-container-orgf36d2a6" class="outline-2">
<h2 id="orgf36d2a6">Reasons being a parent is awesome&#xa0;&#xa0;&#xa0;<span class="tag"><span class="parenting">parenting</span></span></h2>
<div class="outline-text-2" id="text-orgf36d2a6">
<p>
I want to share some of the reasons being a parent has been (somewhat
unexpectedly) so good for me personally. I think these reasons will apply to
almost every parent.
</p>

<p>
Before I start, I want to make it clear my goal is <i>not</i> to convince everyone to
have kids, but rather to show that parenthood is awesome in a couple of ways
that I don&rsquo;t think get talked about enough.
</p>
</div>
<div id="outline-container-org1e33561" class="outline-3">
<h3 id="org1e33561">Being <i>your</i> child&rsquo;s parent has limited (or no) competition</h3>
<div class="outline-text-3" id="text-org1e33561">
<p>
Competition to be your child&rsquo;s best parent is extremely limited. Unlike your
professional interests (and likely your hobbies), the odds are pretty good that
the pool of people trying to parent <i>your child specifically</i> is small. Sometimes,
it might be a pool of one. I certainly feel that I&rsquo;m only competing against
myself&#x2014;that my wife and I occupy different, non-competitive niches in our
daughter&rsquo;s life. Within my niche, I am number one; undefeated! It doesn&rsquo;t matter
to me that there isn&rsquo;t really anyone I&rsquo;m competing against&#x2014;it still gives me
satisfaction to know that I am the best at what I do.
</p>

<p>
Furthermore, whatever you do for your child is going to be a large fraction of
their life experience. It doesn&rsquo;t matter very much if the things you do for them
are imperfect&#x2014;what matters more is that you try. Just trying can get you to
the top of the leaderboard&#x2014;but you have to try.
</p>
</div>
</div>
<div id="outline-container-orgf8b4b05" class="outline-3">
<h3 id="orgf8b4b05">Being a parent is orthogonal to other interests</h3>
<div class="outline-text-3" id="text-orgf8b4b05">
<p>
How good of a parent you are can be completely uncorrelated with your
professional success, your financial situation, or your hobbies. This
decorrelation between parenting and the rest of your life makes it easier to
still feel like a success, even if the only thing you&rsquo;re succeeding in is being
a good parent to your child.
</p>
</div>
</div>
<div id="outline-container-org4f31578" class="outline-3">
<h3 id="org4f31578">Being a parent is a great mix of instant and delayed gratification</h3>
<div class="outline-text-3" id="text-org4f31578">
<p>
There are two kinds of work&#x2014;work that has instantaneous rewards, and work that
has delayed rewards. In my experience, optimal productivity and happiness in
one&rsquo;s work requires a mix of both kinds of work.
</p>

<p>
Working without any short-term feedback on how you&rsquo;re doing makes it difficult
to improve. Also, a lack of short-term rewards in your work will make each day
exhausting, because at the end of each day you can be left thinking &ldquo;What did I
do all that work today for?&rdquo;
</p>

<p>
On the other hand, work that only has short-term rewards will never build up to
a lifetime of achievement that you can look back on with satisfaction. You might
be happy on each individual day, but the overall narrative arc is missing.
</p>

<p>
Parenting, in my opinion, has the perfect mix of short-term and long-term
rewards. In the short-term, it is generally rewarding to spend any amount of
time with your kids doing something they enjoy. In the long-term, the things you
work to teach them (both knowledge and values) can gradually shape your child
into a fully-fledged human that you are happy to associate with.
</p>
</div>
</div>
</div>
<div id="outline-container-orgcc6b1f3" class="outline-2">
<h2 id="orgcc6b1f3">I fixed some chairs&#xa0;&#xa0;&#xa0;<span class="tag"><span class="life">life</span></span></h2>
<div class="outline-text-2" id="text-orgcc6b1f3">
<p>
Today I fixed some chairs and it was the most satisfying thing I did all day.
</p>

<p>
My wife bought some used chairs yesterday, and she noticed after bringing them
home that they were a little wobbly. This evening, I pulled out my tools and
started tightening screws to see if I could fix the problem.
</p>

<p>
In the process, I discovered that one of the chairs had been put together
incorrectly, with two of the legs having been swapped. Because it
was put together wrong, it was very wobbly and some of the pieces were jammed
together at crooked angles.
</p>

<p>
Being able to sit down with a set of tools, diagnose a problem, and make the
world a better place in just half an hour is a wonderful thing to experience. It
wasn&rsquo;t a big fix, but it greatly improves the experience of sitting in those
chairs.
</p>

<p>
I think everybody needs moments like this. Everyone needs to experience
regularly the satisfaction of problem-solving on a short timescale. Most of the
things I do on a daily basis do not give me immediate rewards, and that makes it
important that I find things that do give me immediate satisfaction&#x2014;running,
cooking, and playing with my daughter are examples that come to mind.
</p>
</div>
</div>
