content-org/all-posts.org
* The spiritual dimension of food :food:
:PROPERTIES:
:EXPORT_FILE_NAME: 2024-10-04-the-spiritual-dimension-of-food
:EXPORT_DATE: 2024-10-04
:END:
I baked a loaf of sourdough bread for the first time this week, which taught me
some lessons about how food affects my sense of identity. My lunch today was
very simple: two slices of sourdough bread with a bit of jam. To me, this plain
meal is at least twice as satisfying as a hamburger from any restaurant. I think
it has to do with something I'm calling the "spiritual dimension" of food. One
could also call it the "emotional" or "intangible" dimension of food, but I like
the idea of a meal having a dual nature that feeds both our bodies and our
spirits.

The consumption of food provides us with the nutrients needed for life, but it's
much more than that, like a job is more than just a source of income. Decisions
about what we eat, how we eat, and with whom we eat are important components of
the development of identity.

The spiritual dimension of food is those components of food decisions that
contribute to the nourishment of our spirits --- the intangible parts of who we
are. These are our connections to other people, connections to our environment,
and our knowledge, preferences, and abilities.

For me, the decision to make and eat sourdough was partially motivated by a
desire to be more involved in the food that I eat. By cooking for myself, I take
more responsibility for my nutrition. I am responsible for selecting and
preparing the ingredients. I reduce external dependencies on the (flavor and
price) preferences of other people. Simultaneously, I increase my ability to
provide for other people --- now that I know how to make sourdough bread, I can
(and did) share it with other people. Being more involved in the details of my
life gives me power to modify my life in the ways that I choose.
* Learning vs. task completion :learning:
:PROPERTIES:
:EXPORT_FILE_NAME: 2024-10-04-learning-vs-task-completion
:EXPORT_DATE: 2024-10-04
:END:
Optimize studying for learning, not task completion.

Rote completion of a task is best done by specialization and division of labor.
The classical example of division of labor is [[https://en.wikipedia.org/wiki/Division_of_labour#Adam_Smith][the making of pins]] --- by dividing
the making of a pin into many simple tasks and assigning a worker to each task,
pins can be made more efficiently than if every worker were to go through all
the steps of making a pin.

In the quest for greater efficiency in my studies, I have fallen into the trap
of specialization of labor. If I've already watched two or three lectures, I'm
in a lecture-watching and note-taking frame of mind. If I'm studying with
flashcards, it's easy for me to continue studying with flashcards. When I'm "in
the zone," the least effortful study task is to continue doing what I'm already
doing. This feels more efficient because I'm rapidly checking more things off my
to-do list, but it's not the most effective way for me to /learn./

Learning is not the same as checking tasks off a to-do list. Watching four
lectures instead of one in a single sitting doesn't mean that I've learned four
times as much. On the contrary, I might experience information overload by
trying to absorb too much information in one sitting.

Learning needs to happen incrementally because new information and memories
decay quickly. Self-testing and reflection shortly after the first exposure help
consolidate ideas for long-term storage. Although task-switching while learning
is less efficient in terms of time used studying in a given day, information
will be better retained.

Learning is the cultivation of an interconnected garden of information and ideas
that live in your brain. Plants don't grow, die, or bear fruit all at once.
Neither do ideas. Effective study requires doing the right study tasks at the
right time, not just as quickly as possible.
* Non-overlapping sources of social support
:PROPERTIES:
:EXPORT_DATE: 2024-10-04
:EXPORT_FILE_NAME: 2024-10-04-non-overlapping-sources-of-social-support
:END:
A friend of mine once advised some first-year medical students to develop
/non-overlapping/ sources of social support.

His line of thinking went like this: if your only source of friends is your
peers at school or work, you will be dependent on your work for your social
life. Any disruption to your work would affect your social life, and /vice versa/.

Additionally, socializing with co-workers often constrains conversation to
work-related topics. This is because people naturally default to the things they
have in common, which are the things that are easiest to talk about.

If you're looking for ways to diversify your sources of social support, there
are many different kinds of non-work social groups related to your interests or
passions, such as a cultural affinity group, a political organization, a
volunteer organization, a sports or games group, or a spiritual community.

Developing non-overlapping sources of social support makes your social life
robust to shocks and helps you develop more depth as a person.
