content-org/all-posts.org
* Sabbaths and anti-sabbaths :productivity:
:PROPERTIES:
:EXPORT_FILE_NAME: 2024-10-06-sabbaths-and-anti-sabbaths
:EXPORT_DATE: 2024-10-06
:END:
/How a day dedicated to the profane improves my well-being/

My [[https://alexanderell.is/posts/infinite-scroll/][lizard brain]] was losing the battle against the internet.

I kept finding interesting things that I just /had/ to read. I knew from past
experience that it was unreasonable to attempt quitting reading things on the
internet altogether. I might "get clean" for a few days or a few weeks, but
invariably there would be /something/ I felt was worthy reading material and I'd
be back to my old ways. I felt like the optimal amount of time spent reading
news and blog posts was non-zero, but it also wasn't multiple hours per day.

Eventually I solved my problem by borrowing and inverting an ancient practice:
the Sabbath. In some faiths, the core idea of the Sabbath is that it's a holy
day of rest occurring one day per week, a day not to be profaned by certain
activities such as work, commerce, or recreational pursuits.

However, instead of refraining one day per week from the "unholy" activities of
reading news and blog posts, I flipped it around: one day per week would be set
aside for these "unholy" activities, and one day only. I call this day my
"anti-Sabbath." I chose mine to be on Friday.

The anti-Sabbath has multiple advantages. First, it's a stronger argument, even
if it's less rational. Why can't I read Scott Alexander's [[https://astralcodexten.substack.com/p/every-bay-area-house-party][latest]] [[https://astralcodexten.substack.com/p/another-bay-area-house-party][installment]] [[https://astralcodexten.substack.com/p/even-more-bay-area-house-party][of]]
"Bay Area House Party"? Because it's not Friday yet. My old argument against
reading blog posts was mostly an appeal to productivity, which is a much weaker
argument. I could always rationalize that I'd really be more productive after a
little break, or that it will be a really fast break and then I'll get back to
work. In contrast, I can't argue very much about which day of the week it is.

Second, the anti-Sabbath helps me be more efficient with my reading. Instead of
spreading my internet browsing out over the course of a week, I have to pack it
into a single day, in addition to all of the other things I already have to do
that day. By the time I get around to reading all the new links in my RSS reader
or checking the top page of HackerNews, I'm short on time and I can't afford to
read things that are only slighly interesting to me. I discard links I'm not
very interested in, which ends up being about half of what shows up in my RSS
reader. If I start reading something and discover that it's not very good, I'll
stop reading it. Having limited time in which to enjoy the week's news and other
reading helps me use that time effectively.

Third, the anti-Sabbath turns what was once an escape into a chore. Compressing
all of my reading into one evening makes it a far less enjoyable experience than
if I were to spread it out over the course of a week. Making my distraction
reading an unpleasant experience makes it much, much easier to resist on every
other day of the week. This has been great for breaking my habit of compulsively
checking newsfeeds such as HackerNews.

Finally, anti-Sabbaths help alleviate the fear of missing out that I would get
from trying to quit altogether. When I'm worried that I could be missing
important events, I can remind myself that really important things will still be
headlines by the end of the week, and the things that don't matter by the end of
the week aren't worth reading at all.
* Book Review: Zen and the Art of Motorcycle Maintenance :bookreview:
:PROPERTIES:
:EXPORT_FILE_NAME: 2024-10-07-book-review-zen-and-the-art-of-motorcycle-maintenance
:EXPORT_DATE: 2024-10-07
:END:
/Zen and the Art of Motorcycle Maintenance/ can be thought of as an answer to a
simple question: what is Good?

The answer is something called "Quality."

Quality is a kind of you-know-it-when-you-see-it sort of Goodness that comes
from authentic ways of working, creating, and being. It's the thing that makes
me savor [[https:jrasband.com/posts/2024-10-04-the-spiritual-dimension-of-food][a homemade PB&J]] just as much as a restaurant cheeseburger. It's the
secret sauce, the mojo, the oomph.

/Zen and the Art of Motorcycle Maintenance/ is a book for our time. Everywhere I
look I see a dearth of quality. Technological advances have made it so that
every human activity demands less and less of us, so we give less of ourselves
and get less in return.

This was not a satisfying book to read. Its /dramatis personae/ are in pain. It
asks more questions than it answers. However, it was certainly worth my time.

* Lean into it :life:
:PROPERTIES:
:EXPORT_FILE_NAME: 2024-10-08-lean-into-it
:EXPORT_DATE: 2024-10-08
:END:
In the absence of strong preferences, default to specialization in the ways that
are most accessible to you.

This is a good heuristic because it leverages the random details of your
circumstances into the possibility of a significant comparative advantage.

I think the world needs more people who are willing to "lean into" the quirks of
their individual circumstances. Diversity and specialization are engines of
scientific progress, economic growth, and artistic expression.

By "leaning into it" you attempt to take advantage of your unique position,
whatever it is.

* Improved org-capture on MacOS :emacs:
:PROPERTIES:
:EXPORT_FILE_NAME: 2024-10-09-improved-org-capture-on-macos
:EXPORT_DATE: 2024-10-09
:END:
I read [[https://macowners.club/posts/org-capture-from-everywhere-macos/][this post]] and it got me excited about using =emacsclient= to capture from
anywhere on MacOS. I was particular about getting the capture frame to show only
capture-related buffers, so I needed to make some modifications to the original
code based on comments on [[https://emacs.stackexchange.com/questions/46460/org-capture-frame-with-no-splits][this stackoverflow question]].

Here's my solution:
#+begin_example elisp
  (defun my/make-org-capture-frame ()
    "Create a new frame and run `org-capture'."
    (interactive)
    (make-frame '((name . "capture")
                  (top . 300)
                  (left . 700)
                  (width . 80)
                  (height . 25)))
    (select-frame-by-name "capture")
    (delete-other-windows)
    (cl-letf (((symbol-function 'switch-to-buffer-other-window) #'switch-to-buffer) ((symbol-function 'org-display-buffer-split) #'org-display-buffer-full-frame)) (org-capture)))

  (defun my/org-capture-delete-frame (orig-fun &rest args)
    (if (equal "capture" (frame-parameter nil 'name))
        (delete-frame))
    (apply orig-fun args))

  (advice-add 'user-error :around #'my/org-capture-delete-frame)
  (advice-add 'org-capture-finalize :around #'my/org-capture-delete-frame)
#+end_example

Now you can call =emacsclient -nw --eval "(my/make-org-capture-frame)"= and it
will open a capture buffer in a new frame.

