public/all-posts.html
<div id="outline-container-org127e878" class="outline-2">
<h2 id="org127e878">Sabbaths and anti-sabbaths&#xa0;&#xa0;&#xa0;<span class="tag"><span class="productivity">productivity</span></span></h2>
<div class="outline-text-2" id="text-org127e878">
<p>
<i>How a day dedicated to the profane improves my well-being</i>
</p>

<p>
My <a href="https://alexanderell.is/posts/infinite-scroll/">lizard brain</a> was losing the battle against the internet.
</p>

<p>
I kept finding interesting things that I just <i>had</i> to read. I knew from past
experience that it was unreasonable to attempt quitting reading things on the
internet altogether. I might &ldquo;get clean&rdquo; for a few days or a few weeks, but
invariably there would be <i>something</i> I felt was worthy reading material and I&rsquo;d
be back to my old ways. I felt like the optimal amount of time spent reading
news and blog posts was non-zero, but it also wasn&rsquo;t multiple hours per day.
</p>

<p>
Eventually I solved my problem by borrowing and inverting an ancient practice:
the Sabbath. In some faiths, the core idea of the Sabbath is that it&rsquo;s a holy
day of rest occurring one day per week, a day not to be profaned by certain
activities such as work, commerce, or recreational pursuits.
</p>

<p>
However, instead of refraining one day per week from the &ldquo;unholy&rdquo; activities of
reading news and blog posts, I flipped it around: one day per week would be set
aside for these &ldquo;unholy&rdquo; activities, and one day only. I call this day my
&ldquo;anti-Sabbath.&rdquo; I chose mine to be on Friday.
</p>

<p>
The anti-Sabbath has multiple advantages. First, it&rsquo;s a stronger argument, even
if it&rsquo;s less rational. Why can&rsquo;t I read Scott Alexander&rsquo;s <a href="https://astralcodexten.substack.com/p/every-bay-area-house-party">latest</a> <a href="https://astralcodexten.substack.com/p/another-bay-area-house-party">installment</a> <a href="https://astralcodexten.substack.com/p/even-more-bay-area-house-party">of</a>
&ldquo;Bay Area House Party&rdquo;? Because it&rsquo;s not Friday yet. My old argument against
reading blog posts was mostly an appeal to productivity, which is a much weaker
argument. I could always rationalize that I&rsquo;d really be more productive after a
little break, or that it will be a really fast break and then I&rsquo;ll get back to
work. In contrast, I can&rsquo;t argue very much about which day of the week it is.
</p>

<p>
Second, the anti-Sabbath helps me be more efficient with my reading. Instead of
spreading my internet browsing out over the course of a week, I have to pack it
into a single day, in addition to all of the other things I already have to do
that day. By the time I get around to reading all the new links in my RSS reader
or checking the top page of HackerNews, I&rsquo;m short on time and I can&rsquo;t afford to
read things that are only slighly interesting to me. I discard links I&rsquo;m not
very interested in, which ends up being about half of what shows up in my RSS
reader. If I start reading something and discover that it&rsquo;s not very good, I&rsquo;ll
stop reading it. Having limited time in which to enjoy the week&rsquo;s news and other
reading helps me use that time effectively.
</p>

<p>
Third, the anti-Sabbath turns what was once an escape into a chore. Compressing
all of my reading into one evening makes it a far less enjoyable experience than
if I were to spread it out over the course of a week. Making my distraction
reading an unpleasant experience makes it much, much easier to resist on every
other day of the week. This has been great for breaking my habit of compulsively
checking newsfeeds such as HackerNews.
</p>

<p>
Finally, anti-Sabbaths help alleviate the fear of missing out that I would get
from trying to quit altogether. When I&rsquo;m worried that I could be missing
important events, I can remind myself that really important things will still be
headlines by the end of the week, and the things that don&rsquo;t matter by the end of
the week aren&rsquo;t worth reading at all.
</p>
</div>
</div>
<div id="outline-container-org5669b21" class="outline-2">
<h2 id="org5669b21">Book Review: Zen and the Art of Motorcycle Maintenance&#xa0;&#xa0;&#xa0;<span class="tag"><span class="bookreview">bookreview</span></span></h2>
<div class="outline-text-2" id="text-org5669b21">
<p>
<i>Zen and the Art of Motorcycle Maintenance</i> can be thought of as an answer to a
simple question: what is Good?
</p>

<p>
The answer is something called &ldquo;Quality.&rdquo;
</p>

<p>
Quality is a kind of you-know-it-when-you-see-it sort of Goodness that comes
from authentic ways of working, creating, and being. It&rsquo;s the thing that makes
me savor <a href="https:jrasband.com/posts/2024-10-04-the-spiritual-dimension-of-food">a homemade PB&amp;J</a> just as much as a restaurant cheeseburger. It&rsquo;s the
secret sauce, the mojo, the oomph.
</p>

<p>
<i>Zen and the Art of Motorcycle Maintenance</i> is a book for our time. Everywhere I
look I see a dearth of quality. Technological advances have made it so that
every human activity demands less and less of us, so we give less of ourselves
and get less in return.
</p>

<p>
This was not a satisfying book to read. Its <i>dramatis personae</i> are in pain. It
asks more questions than it answers. However, it was certainly worth my time.
</p>
</div>
</div>
<div id="outline-container-orgd88f6cb" class="outline-2">
<h2 id="orgd88f6cb">Lean into it&#xa0;&#xa0;&#xa0;<span class="tag"><span class="life">life</span></span></h2>
<div class="outline-text-2" id="text-orgd88f6cb">
<p>
In the absence of strong preferences, default to specialization in the ways that
are most accessible to you.
</p>

<p>
This is a good heuristic because it leverages the random details of your
circumstances into the possibility of a significant comparative advantage.
</p>

<p>
I think the world needs more people who are willing to &ldquo;lean into&rdquo; the quirks of
their individual circumstances. Diversity and specialization are engines of
scientific progress, economic growth, and artistic expression.
</p>

<p>
By &ldquo;leaning into it&rdquo; you attempt to take advantage of your unique position,
whatever it is.
</p>
</div>
</div>
<div id="outline-container-orgd13aadb" class="outline-2">
<h2 id="orgd13aadb">Improved org-capture on MacOS&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs">emacs</span></span></h2>
<div class="outline-text-2" id="text-orgd13aadb">
<p>
I read <a href="https://macowners.club/posts/org-capture-from-everywhere-macos/">this post</a> and it got me excited about using <code>emacsclient</code> to capture from
anywhere on MacOS. I was particular about getting the capture frame to show only
capture-related buffers, so I needed to make some modifications to the original
code based on comments on <a href="https://emacs.stackexchange.com/questions/46460/org-capture-frame-with-no-splits">this stackoverflow question</a>.
</p>

<p>
Here&rsquo;s my solution:
</p>
<pre class="example" id="orgc49d5cb">
(defun my/make-org-capture-frame ()
  "Create a new frame and run `org-capture'."
  (interactive)
  (make-frame '((name . "capture")
                (top . 300)
                (left . 700)
                (width . 80)
                (height . 25)))
  (select-frame-by-name "capture")
  (delete-other-windows)
  (cl-letf (((symbol-function 'switch-to-buffer-other-window) #'switch-to-buffer) ((symbol-function 'org-display-buffer-split) #'org-display-buffer-full-frame)) (org-capture)))

(defun my/org-capture-delete-frame (orig-fun &amp;rest args)
  (if (equal "capture" (frame-parameter nil 'name))
      (delete-frame))
  (apply orig-fun args))

(advice-add 'user-error :around #'my/org-capture-delete-frame)
(advice-add 'org-capture-finalize :around #'my/org-capture-delete-frame)
</pre>

<p>
Now you can call <code>emacsclient -nw --eval "(my/make-org-capture-frame)"</code> and it
will open a capture buffer in a new frame.
</p>
</div>
</div>
