content-org/all-posts.org
* An overview of my Emacs journey :emacs:
:PROPERTIES:
:EXPORT_FILE_NAME: 2024-10-10-an-overview-of-my-emacs-journey
:EXPORT_DATE: 2024-10-10
:END:
I'll probably write more about the ways that Emacs (and Org mode) has improved
my life, but here's a brief summary.

I started using Emacs during college after getting introduced to Org mode by my
research mentor. I'd just gotten burned by two of my preferred software tools
getting shut down---one was a text editor, and the other was a productivity
manager, so I was about as receptive as one could be to the idea of open-source
text editors and productivity managers.

Over the next few years, Emacs became an integral part of my writing,
note-taking, and programming workflows. Part of what I enjoyed about Emacs was
how it challenged me to learn more and to become more. Emacs didn't hold my
hand---it demanded that I learn how to program.

Another key component was the community. Without the abundance of blogs and
forums and YouTube tutorials guiding me at each step of my Emacs path, I
probably would have given up early on. The thing that I loved the most about the
Emacs (and computer science community in general) is that they seemed to be the
kind of people I wanted to be around. They were curious, hard-working, and
clever. They had interesting ideas and interesting taste.

Now, I'm a committed Emacs user. It's not for everyone, but I love how it's
helped me grow, I love the ideas and communities it's helped me discover, and I
love the sense of ownership and independence that open source brings me.

* High-yield ways to increase happiness :life:
:PROPERTIES:
:EXPORT_FILE_NAME: 2024-10-11-high-yield-ways-to-increase-happiness
:EXPORT_DATE: 2024-10-11
:END:
The advertising industry usually tries to tell you that if you buy their
product or service, you will be happy.

The problem with this approach to buying happiness is that the increase in
happiness that you get from buying something will usually attenuate after a
short period of time.

Fortunately, there are more effective, longer-lasting ways to increase
happiness. They just aren't being marketed to you because there's no money in
them.

** Decrease annoyances
My favorite way to improve life happiness in the long-term is to fix things that
bother me. If you're bothered about twice a week by your gate being stuck when
you want to take out the trash (as I was), it's kind of a no-brainer to take an
hour to diagnose and fix the problem.

This principle can be applied to a wide variety of annoyances. Traffic during a
morning commute. Having to make yourself breakfast every morning. An
inconvenient location for a tool that gets used regularly.

There are probably dozens of inconveniences and frustrations that you deal with
every day, and it's probably worth more than you think to eliminate those daily
annoyances. As you spend less and less of your day being annoyed, you'll be
happier and more productive. Your interpersonal relationships might also
improve, as you'll have more emotional bandwidth for dealing with interpersonal
frictions.

** Build in recurring pleasures that don't saturate
Try to find things that you know you can get excited about every day. For me, I
will always get excited about a good meal when I'm hungry, so I try to make sure
that my meals can be a regular source of happiness in my day. I do that by
choosing high-quality ingredients and making meals that will make me happy, not
just fill my stomach.

Whatever it is that can make you happy (and not just entertained) every single
time, try to build it into your daily routine. Have a few, regularly-occurring
bright spots you can look forward to each day. It will increase your average
daily happiness in the long run.

** Think in happier ways
Happiness is a mental and emotional state. One of the most significant, but
difficult things you can do for your happiness is to try to cultivate mental and
emotional habits that facilitate happiness.

This is a complicated topic. It touches on mental illness and the limits of our
ability to control our own thoughts. For now, I think it suffices to say that
it's often possible to change the way that you think in a way that improves your
happiness. There are many frameworks for doing so.

* Why I make my own flashcards :learning:
:PROPERTIES:
:EXPORT_FILE_NAME: 2024-10-12-why-i-make-my-own-flashcards
:EXPORT_DATE: 2024-10-12
:END:
During medical school, I started using the Anki spaced repetition system to put
large amounts of knowledge into my long-term memory. At first, I used decks made
by other students. Eventually, I found that I preferred creating my own
flashcards over using decks of pre-made flashcards.

** Focus
Making my own flashcards is a significant use of time and effort. At first
blush, that sounds like it's a disadvantage, but it can also be framed as a
benefit. Because there is a non-zero cost to making my flashcards, it
incentivizes me to make the minimum number of flashcards necessary and no more.
I found that before I started making my own cards, I was tempted to download
more decks than I reasonably had time to study. The cost incurred by making my
own cards helps me foucs my energies on just the facts that I want to remember.

** Ownership
Because I make my own flashcards, I have a deeper sense of accountability for my
study. When I see a "bad" flashcard (e.g. one that is poorly worded or
ambiguous) I know that it's my fault and I need to fix it. When using a deck
made by someone else, it's easier to ignore the card and keep studying without
improving anything. The knowledge that my flashcards are fully my responsibility
helps me keep iterating and making better and better cards.

** Schema construction
The process of making flashcards helps me construct a schema into which I can
place facts. When I make flashcards, I have to ask myself what the most
important things to know are. As I organize my notes, it encourages me to think
about the relationships between concepts---how they are similar, how they are
different. By making flashcards, I give myself time to think about the facts I'm
studying and how they are related---something I wouldn't be forced to do if I
were to rely soley on decks made by other people.

