public/all-posts.html
<div id="outline-container-orgc8d5b7d" class="outline-2">
<h2 id="orgc8d5b7d">An overview of my Emacs journey&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs">emacs</span></span></h2>
<div class="outline-text-2" id="text-orgc8d5b7d">
<p>
I&rsquo;ll probably write more about the ways that Emacs (and Org mode) has improved
my life, but here&rsquo;s a brief summary.
</p>

<p>
I started using Emacs during college after getting introduced to Org mode by my
research mentor. I&rsquo;d just gotten burned by two of my preferred software tools
getting shut down&#x2014;one was a text editor, and the other was a productivity
manager, so I was about as receptive as one could be to the idea of open-source
text editors and productivity managers.
</p>

<p>
Over the next few years, Emacs became an integral part of my writing,
note-taking, and programming workflows. Part of what I enjoyed about Emacs was
how it challenged me to learn more and to become more. Emacs didn&rsquo;t hold my
hand&#x2014;it demanded that I learn how to program.
</p>

<p>
Another key component was the community. Without the abundance of blogs and
forums and YouTube tutorials guiding me at each step of my Emacs path, I
probably would have given up early on. The thing that I loved the most about the
Emacs (and computer science community in general) is that they seemed to be the
kind of people I wanted to be around. They were curious, hard-working, and
clever. They had interesting ideas and interesting taste.
</p>

<p>
Now, I&rsquo;m a committed Emacs user. It&rsquo;s not for everyone, but I love how it&rsquo;s
helped me grow, I love the ideas and communities it&rsquo;s helped me discover, and I
love the sense of ownership and independence that open source brings me.
</p>
</div>
</div>
<div id="outline-container-orgcb6b6ba" class="outline-2">
<h2 id="orgcb6b6ba">High-yield ways to increase happiness&#xa0;&#xa0;&#xa0;<span class="tag"><span class="life">life</span></span></h2>
<div class="outline-text-2" id="text-orgcb6b6ba">
<p>
The advertising industry usually tries to tell you that if you buy their
product or service, you will be happy.
</p>

<p>
The problem with this approach to buying happiness is that the increase in
happiness that you get from buying something will usually attenuate after a
short period of time.
</p>

<p>
Fortunately, there are more effective, longer-lasting ways to increase
happiness. They just aren&rsquo;t being marketed to you because there&rsquo;s no money in
them.
</p>
</div>
<div id="outline-container-org87ec107" class="outline-3">
<h3 id="org87ec107">Decrease annoyances</h3>
<div class="outline-text-3" id="text-org87ec107">
<p>
My favorite way to improve life happiness in the long-term is to fix things that
bother me. If you&rsquo;re bothered about twice a week by your gate being stuck when
you want to take out the trash (as I was), it&rsquo;s kind of a no-brainer to take an
hour to diagnose and fix the problem.
</p>

<p>
This principle can be applied to a wide variety of annoyances. Traffic during a
morning commute. Having to make yourself breakfast every morning. An
inconvenient location for a tool that gets used regularly.
</p>

<p>
There are probably dozens of inconveniences and frustrations that you deal with
every day, and it&rsquo;s probably worth more than you think to eliminate those daily
annoyances. As you spend less and less of your day being annoyed, you&rsquo;ll be
happier and more productive. Your interpersonal relationships might also
improve, as you&rsquo;ll have more emotional bandwidth for dealing with interpersonal
frictions.
</p>
</div>
</div>
<div id="outline-container-org52af439" class="outline-3">
<h3 id="org52af439">Build in recurring pleasures that don&rsquo;t saturate</h3>
<div class="outline-text-3" id="text-org52af439">
<p>
Try to find things that you know you can get excited about every day. For me, I
will always get excited about a good meal when I&rsquo;m hungry, so I try to make sure
that my meals can be a regular source of happiness in my day. I do that by
choosing high-quality ingredients and making meals that will make me happy, not
just fill my stomach.
</p>

<p>
Whatever it is that can make you happy (and not just entertained) every single
time, try to build it into your daily routine. Have a few, regularly-occurring
bright spots you can look forward to each day. It will increase your average
daily happiness in the long run.
</p>
</div>
</div>
<div id="outline-container-orgcd6f5e0" class="outline-3">
<h3 id="orgcd6f5e0">Think in happier ways</h3>
<div class="outline-text-3" id="text-orgcd6f5e0">
<p>
Happiness is a mental and emotional state. One of the most significant, but
difficult things you can do for your happiness is to try to cultivate mental and
emotional habits that facilitate happiness.
</p>

<p>
This is a complicated topic. It touches on mental illness and the limits of our
ability to control our own thoughts. For now, I think it suffices to say that
it&rsquo;s often possible to change the way that you think in a way that improves your
happiness. There are many frameworks for doing so.
</p>
</div>
</div>
</div>
<div id="outline-container-orgb846309" class="outline-2">
<h2 id="orgb846309">Why I make my own flashcards&#xa0;&#xa0;&#xa0;<span class="tag"><span class="learning">learning</span></span></h2>
<div class="outline-text-2" id="text-orgb846309">
<p>
During medical school, I started using the Anki spaced repetition system to put
large amounts of knowledge into my long-term memory. At first, I used decks made
by other students. Eventually, I found that I preferred creating my own
flashcards over using decks of pre-made flashcards.
</p>
</div>
<div id="outline-container-orgc18d984" class="outline-3">
<h3 id="orgc18d984">Focus</h3>
<div class="outline-text-3" id="text-orgc18d984">
<p>
Making my own flashcards is a significant use of time and effort. At first
blush, that sounds like it&rsquo;s a disadvantage, but it can also be framed as a
benefit. Because there is a non-zero cost to making my flashcards, it
incentivizes me to make the minimum number of flashcards necessary and no more.
I found that before I started making my own cards, I was tempted to download
more decks than I reasonably had time to study. The cost incurred by making my
own cards helps me foucs my energies on just the facts that I want to remember.
</p>
</div>
</div>
<div id="outline-container-orga3ea19d" class="outline-3">
<h3 id="orga3ea19d">Ownership</h3>
<div class="outline-text-3" id="text-orga3ea19d">
<p>
Because I make my own flashcards, I have a deeper sense of accountability for my
study. When I see a &ldquo;bad&rdquo; flashcard (e.g. one that is poorly worded or
ambiguous) I know that it&rsquo;s my fault and I need to fix it. When using a deck
made by someone else, it&rsquo;s easier to ignore the card and keep studying without
improving anything. The knowledge that my flashcards are fully my responsibility
helps me keep iterating and making better and better cards.
</p>
</div>
</div>
<div id="outline-container-org9cce42e" class="outline-3">
<h3 id="org9cce42e">Schema construction</h3>
<div class="outline-text-3" id="text-org9cce42e">
<p>
The process of making flashcards helps me construct a schema into which I can
place facts. When I make flashcards, I have to ask myself what the most
important things to know are. As I organize my notes, it encourages me to think
about the relationships between concepts&#x2014;how they are similar, how they are
different. By making flashcards, I give myself time to think about the facts I&rsquo;m
studying and how they are related&#x2014;something I wouldn&rsquo;t be forced to do if I
were to rely soley on decks made by other people.
</p>
</div>
</div>
</div>
