public/all-posts.html
<div id="outline-container-org865b2d2" class="outline-2">
<h2 id="org865b2d2">Find joys that satiate you&#xa0;&#xa0;&#xa0;<span class="tag"><span class="life">life</span></span></h2>
<div class="outline-text-2" id="text-org865b2d2">
<p>
Some activities are &rsquo;satiating&rsquo;&#x2014;when you&rsquo;re done, you don&rsquo;t have an increased
desire to do or consume more. Think about a meal that leaves your hunger totally
satisfied. That kind of a pleasure is the kind of pleasure that we ought to be
spending most of our time on, in contrast to things that, like potato chips, never
satisfy the desire they were supposed to address in the first place.
</p>

<p>
Many modern forms of entertainment, such as social media and streaming
television, don&rsquo;t satiate. As a result, people spend much more time consuming
than they intend to. To continue the analogy, they wanted to satisfy their
hunger, but instead of eating a meal, they opened up a bag of potato chips.
</p>

<p>
Look at your day and think about the things that you spend time doing. Why do
you do those things? What needs are you trying to fufill? Are those needs being
satiated? As you consciously meet your needs, you will be satiated.
</p>
</div>
</div>
<div id="outline-container-org99962f4" class="outline-2">
<h2 id="org99962f4">Values vs. tastes&#xa0;&#xa0;&#xa0;<span class="tag"><span class="life">life</span></span></h2>
<div class="outline-text-2" id="text-org99962f4">
<p>
After I got married, I learned an important lesson: there is a big difference
between differences in taste and differences in values. Differences in taste are
easy to live with and usually easy to compromise on. Differences in values are
basically impossible to come to a satisfactory compromise on. The way you like
your scrambled eggs is a taste. Whether you think it&rsquo;s morally justified to be
eating eggs at all is a value.
</p>

<p>
What&rsquo;s the difference between a taste and a value? I think a taste is basically
a personal preference which you recognize is not intrinsically superior to other
preferences. In contrast, a value is something that you believe in because you
view it as being better or more true than other, competing values. Values are
not viewed as a matter of preference, which makes them more difficult to
compromise on.
</p>

<p>
Although it&rsquo;s much more difficult to find compromise when there&rsquo;s a difference
of values, a values-centered discussion can be very meaningful and productive.
It&rsquo;s very much possible to have one set of values, yet respect deeply another
person&rsquo;s commitment to a different set of values. Values are also typically not
a choice between right and wrong, but a choice between many good options, one of
which is deemed most important. When you understand someone at the level of
their values, you gain far more insight into their reasoning than if you were to
understand them at a more superficial level.
</p>
</div>
</div>
<div id="outline-container-org74393c7" class="outline-2">
<h2 id="org74393c7">Deliberate practice of self-mastery&#xa0;&#xa0;&#xa0;<span class="tag"><span class="productivity">productivity</span>&#xa0;<span class="life">life</span></span></h2>
<div class="outline-text-2" id="text-org74393c7">
<p>
The single most important factor for success is having self-mastery.
</p>

<p>
Self-mastery is difficult to teach, but it can be cultivated. The key is to
developing self-mastery is proper stewardship of the reward circuits of your
brain. You need to make sure that your brain sends reward signal in ways that
will direct you to achieve your goals.
</p>

<p>
The main way that I have accomplished this is through deliberate practice. Every
time I want some kind of reward or break, I push myself to work just a little
longer before I reward myself. Then, when I accomplish my goal, the sense of
reward is associated with self-mastery, rather than giving in, thereby
reinforcing a sense of pleasure at delayed gratification.
</p>

<p>
I&rsquo;m now at a point where a lot of the pleasure in my day comes from the
knowledge that I have successfully achieved my goals. On nights when I force
myself to do the dishes and finish my homework before I let myself have dessert,
it&rsquo;s the sense of accomplishment that is the bigger reward.
</p>

<p>
This is a difficult pattern of thought to cultivate. It&rsquo;s taken me almost a
decade to get here. The rewards are enormous, however. The ability to say no to
basically any distraction or temptation in favor of accomplishing my goals has
been of critical importance as I try to balance my many responsibilities and
goals.
</p>

<p>
As a final note, self-mastery does not have to mean that every waking moment is
spent working or studying. It just means that your decisions are more fully
yours. I have found that self-mastery has actually increased my enjoyment of
leisure activities, because I can engage in them with the knowledge that I have
picked leisure because it is what I want to do, not because it is easy.
</p>
</div>
</div>
<div id="outline-container-org3337cb7" class="outline-2">
<h2 id="org3337cb7">Introductory CS education misses the useful stuff</h2>
<div class="outline-text-2" id="text-org3337cb7">
<p>
The most important things I&rsquo;ve learned about how to use a computer were things
that I&rsquo;ve had to teach myself.
</p>

<p>
My formal CS education consists of an AP class in high school, an
introductory-level CS class in college, and three computational physics labs. In
none of those classes did I learn about shell scripting, version control, or
package management.
</p>

<p>
Together, these three skills have opened up worlds of
productivity and possibility for me. They gave me the ability to write quick
scripts to move and rename files <i>en masse</i>, improved how I fix bugs and implement
features, and gave me access to a huge ecosystem of publicly available tools.
</p>

<p>
I think it&rsquo;s likely that this observation applies to formal education generally.
Rather than starting with the most useful things, formal education usually
starts with some theoretical fundamentals which are supposed to build up to
something useful (think &ldquo;the mitochondria is the powerhouse of the cell&rdquo;). Maybe
we need to consider inverting that structure, so that students first learn how
to do useful things, and then they can learn the foundational knowledge they&rsquo;ll
need as they want to improve their skills.
</p>
</div>
</div>
<div id="outline-container-org71cb2ba" class="outline-2">
<h2 id="org71cb2ba">Better is better than more&#xa0;&#xa0;&#xa0;<span class="tag"><span class="productivity">productivity</span></span></h2>
<div class="outline-text-2" id="text-org71cb2ba">
<p>
Most of the time, when I say &ldquo;I should be doing more&rdquo; what I <i>should</i> be saying is
&ldquo;I should be doing things differently.&rdquo;
</p>

<p>
It&rsquo;s often assumed that we could always be doing <i>more</i>. Exercising more, sleeping
more, working more, reading more&hellip; more, more, more. I&rsquo;m not convinced that&rsquo;s
true.
</p>

<p>
There are 24 hours in a day, and we spend each minute of the day doing
<i>something</i>. We&rsquo;re never going to be able to fit more than 24 hours of time into a
day. The task left to us is to determine <i>how</i> we&rsquo;re going to use the time we
have.
</p>

<p>
Why is this distinction important? Psychologically, it can be daunting to think
about adding things to our to-do list without taking anything away. I&rsquo;ve found
it&rsquo;s helpful to think about how I should be doing things better rather than how
I should be doing more.
</p>

<p>
My success rate for behavioral modification improves when I&rsquo;m able to identify
how existing components of my daily life will be modified or replaced by
something better. Instead of planning to complete a task at a vague
&ldquo;sometime,&rdquo; I can identify a specific time of day at which I will change my
behavior from what was previously planned. This dramatically increases my
chances of success.
</p>

<p>
This principle also applies in large organizations and bureaucracies. Better is
superior to more.
</p>
</div>
</div>
