content-org/all-posts.org
* TODO How to love what you do :life:
<Appreciation of the Good> can help foster love for any worthwhile
endeavor.

It's been said that you should [[https://paulgraham.com/when.html][do what you love]]. One way to do what you love is
to [[https://www.justinmath.com/love-what-you-do/][love what you do]]. But how exactly does one love what they do, especially if
they aren't in love with it right now?

I don't totally agree with the idea (in the previous link) that love is
"perpetual hardcore effort." I definitely think that the fullest expression of
love necessarily involves "perpetual hardcore effort," but I don't think that
it's a sufficient condition. One can put a lot of effort into something, but
that doesn't make it love. Indeed, there are lots of people around the world who
put lots of effort (out of financial necessity, perhaps) into their careers
without being in love with their job. So, besides effort, what does one need to
do to love their job?


* TODO Emigration and illiberalization of the developing world
Emigration from developing countries to Western countries may be partially to
blame for the stagnation of liberal democratic reform in the developing world.

As a rule, developed, Western countries (e.g. the United States, Western Europe,
and the Anglophone countries) are pretty tolerant of deviance from traditional
norms. These are countries with strong protections for individual expression
along many dimensions---speech, religious and political belief, and sexuality to
name a few.

As a rule, developing countries tend to be less tolerant of deviation from
traditional norms.

This creates strong incentives for the most liberal, Westernized (and often the
most educated and wealthiest) citizens of developing countries to move to places
that will be more tolerant of them.

The result is like Maxwell's demon, but for geopolitics. The potential leaders
and catalysts for democratic reform leave, and no progress is made.

* TODO Sunday Corner
** "Call the sabbath a delight"
#+begin_quote
If thou turn away thy foot from the sabbath, from doing thy pleasure on my holy
day; and call the sabbath a delight\dots Then shalt thou delight thyself in the Lord; and I
will cause thee to ride upon the high places of the earth\dots
---Isaiah 58:13
#+end_quote

I never expected to have such strong opinions about the observance of a day of
rest. As a child, it was just something that my family did, and I went along
with them. During my adult years, however, the deliberate observance of a weekly
sabbath has been wonderful for my mental health and my family relationships.

The sabbath is a day that is set aside to be different from the other days of
the week. It is different because it is supposed to be filled with activities
that are higher and holier than what takes up most of our time the other days of
the week. To encourage holier actions on the sabbath, certain "profane"
activities may be discouraged, restricted, or forbidden during the twenty-four
hour period of the sabbath.

There are many ways one can choose to make the sabbath a special day, a day set
apart from all the others. Here are some of the ways that I observe the sabbath:
- Family: the sabbath is a day on which I block out time specifically for
  strengthening my family relationships
- Service: on the sabbath, I try to take every possible opportunity to serve others
- Refrain from work: this is subjective, but I don't do professional work,
  schoolwork, or non-daily chores (washing dishes is ok, mowing the lawn is not)
- Refrain from entertainment: if I consume books, music, or other media on the
  sabbath, I hold it to a much higher standard

Observing the sabbath has been wonderful for my mental health and my family
relationships. It is an immense comfort to me to know that however hard my
professional life is going during the week, I will have at least one day each
week on which I will set aside my worldly cares and anxieties. On the sabbath, I
might be working just as hard as other days of the week, but my focus is
different---my focus will be on my family, or on the people whom I'm trying to
serve.

The key to the sabbath lies in submission---the temporal, worldly, or immediate
must submit to the spiritual, to the eternal. A few years ago, I realized that
my personal sabbath observance would be much improved by making sure that I wasn't
reading science fiction or fantasy novels on the sabbath. This change was very
difficult for me, because I love books, but it made a huge difference because it
changed the sabbath from a day of mere entertainment and relaxation to a day of
rest and renewal.

To discover the benefits of keeping a sabbath, one must try it, and try it
consistently. It may be difficult to adjust to at first, but I promise that you
will see some of the same benefits that I have seen.

* TODO We need more and better evals for humans
If my stint in higher education has taught me anything, it's that we need better ways of measuring the ways that different humans have different abilities.

# Why?
The reason that many people love markets so much is that they provide a mechanism for communicating. Many of society's ills today are described as market failures. A common cause of market failures is information asymmetry between buyers and sellers. For example, both employers and potential employees have incentives to misrepresent themselves to each other.

