public/all-posts.html
<div id="outline-container-org2d18366" class="outline-2">
<h2 id="org2d18366"><span class="todo TODO">TODO</span> How to love what you do&#xa0;&#xa0;&#xa0;<span class="tag"><span class="life">life</span></span></h2>
<div class="outline-text-2" id="text-org2d18366">
<p>
&lt;Appreciation of the Good&gt; can help foster love for any worthwhile
endeavor.
</p>

<p>
It&rsquo;s been said that you should <a href="https://paulgraham.com/when.html">do what you love</a>. One way to do what you love is
to <a href="https://www.justinmath.com/love-what-you-do/">love what you do</a>. But how exactly does one love what they do, especially if
they aren&rsquo;t in love with it right now?
</p>

<p>
I don&rsquo;t totally agree with the idea (in the previous link) that love is
&ldquo;perpetual hardcore effort.&rdquo; I definitely think that the fullest expression of
love necessarily involves &ldquo;perpetual hardcore effort,&rdquo; but I don&rsquo;t think that
it&rsquo;s a sufficient condition. One can put a lot of effort into something, but
that doesn&rsquo;t make it love. Indeed, there are lots of people around the world who
put lots of effort (out of financial necessity, perhaps) into their careers
without being in love with their job. So, besides effort, what does one need to
do to love their job?
</p>
</div>
</div>
<div id="outline-container-org2c2e508" class="outline-2">
<h2 id="org2c2e508"><span class="todo TODO">TODO</span> Emigration and illiberalization of the developing world</h2>
<div class="outline-text-2" id="text-org2c2e508">
<p>
Emigration from developing countries to Western countries may be partially to
blame for the stagnation of liberal democratic reform in the developing world.
</p>

<p>
As a rule, developed, Western countries (e.g. the United States, Western Europe,
and the Anglophone countries) are pretty tolerant of deviance from traditional
norms. These are countries with strong protections for individual expression
along many dimensions&#x2014;speech, religious and political belief, and sexuality to
name a few.
</p>

<p>
As a rule, developing countries tend to be less tolerant of deviation from
traditional norms.
</p>

<p>
This creates strong incentives for the most liberal, Westernized (and often the
most educated and wealthiest) citizens of developing countries to move to places
that will be more tolerant of them.
</p>

<p>
The result is like Maxwell&rsquo;s demon, but for geopolitics. The potential leaders
and catalysts for democratic reform leave, and no progress is made.
</p>
</div>
</div>
<div id="outline-container-org05271a6" class="outline-2">
<h2 id="org05271a6"><span class="todo TODO">TODO</span> Sunday Corner</h2>
<div class="outline-text-2" id="text-org05271a6">
</div>
<div id="outline-container-org9122907" class="outline-3">
<h3 id="org9122907">&ldquo;Call the sabbath a delight&rdquo;</h3>
<div class="outline-text-3" id="text-org9122907">
<blockquote>
<p>
If thou turn away thy foot from the sabbath, from doing thy pleasure on my holy
day; and call the sabbath a delight&hellip; Then shalt thou delight thyself in the Lord; and I
will cause thee to ride upon the high places of the earth&hellip;
&#x2014;Isaiah 58:13
</p>
</blockquote>

<p>
I never expected to have such strong opinions about the observance of a day of
rest. As a child, it was just something that my family did, and I went along
with them. During my adult years, however, the deliberate observance of a weekly
sabbath has been wonderful for my mental health and my family relationships.
</p>

<p>
The sabbath is a day that is set aside to be different from the other days of
the week. It is different because it is supposed to be filled with activities
that are higher and holier than what takes up most of our time the other days of
the week. To encourage holier actions on the sabbath, certain &ldquo;profane&rdquo;
activities may be discouraged, restricted, or forbidden during the twenty-four
hour period of the sabbath.
</p>

<p>
There are many ways one can choose to make the sabbath a special day, a day set
apart from all the others. Here are some of the ways that I observe the sabbath:
</p>
<ul class="org-ul">
<li>Family: the sabbath is a day on which I block out time specifically for
strengthening my family relationships</li>
<li>Service: on the sabbath, I try to take every possible opportunity to serve others</li>
<li>Refrain from work: this is subjective, but I don&rsquo;t do professional work,
schoolwork, or non-daily chores (washing dishes is ok, mowing the lawn is not)</li>
<li>Refrain from entertainment: if I consume books, music, or other media on the
sabbath, I hold it to a much higher standard</li>
</ul>

<p>
Observing the sabbath has been wonderful for my mental health and my family
relationships. It is an immense comfort to me to know that however hard my
professional life is going during the week, I will have at least one day each
week on which I will set aside my worldly cares and anxieties. On the sabbath, I
might be working just as hard as other days of the week, but my focus is
different&#x2014;my focus will be on my family, or on the people whom I&rsquo;m trying to
serve.
</p>

<p>
The key to the sabbath lies in submission&#x2014;the temporal, worldly, or immediate
must submit to the spiritual, to the eternal. A few years ago, I realized that
my personal sabbath observance would be much improved by making sure that I wasn&rsquo;t
reading science fiction or fantasy novels on the sabbath. This change was very
difficult for me, because I love books, but it made a huge difference because it
changed the sabbath from a day of mere entertainment and relaxation to a day of
rest and renewal.
</p>

<p>
To discover the benefits of keeping a sabbath, one must try it, and try it
consistently. It may be difficult to adjust to at first, but I promise that you
will see some of the same benefits that I have seen.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Joshua Rasband (<a href="mailto:joshuarasband@Joshuas-Laptop.local">joshuarasband@Joshuas-Laptop.local</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1 (<a href="https://orgmode.org">Org</a> mode 9.7.11)</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
